amperserwis/collin80_esp32_can/src/mcp2515.cpp
/*
  MCP2515.cpp - Library for Microchip MCP2515 CAN Controller
  
  Author: David Harding
  Maintainer: RechargeCar Inc (http://rechargecar.com)
  Further Modification: Collin Kidder
  
  Created: 11/08/2010
  
  For further information see:
  
  http://ww1.microchip.com/downloads/en/DeviceDoc/21801e.pdf
  http://en.wikipedia.org/wiki/CAN_bus


  This library is free software; you can redistribute it and/or
  modify it under the terms of the GNU Lesser General Public
  License as published by the Free Software Foundation; either
  version 2.1 of the License, or (at your option) any later version.

  This library is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
  Lesser General Public License for more details.

  You should have received a copy of the GNU Lesser General Public
  License along with this library; if not, write to the Free Software
  Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA
*/

#define MCP2515_SCK  18  // SCK input of MCP2517 
#define MCP2515_MOSI 23 // SDI input of MCP2517  
#define MCP2515_MISO 19 // SDO output of MCP2517 


#include "Arduino.h"
#include "SPI.h"
#include "mcp2515.h"
#include "mcp2515_defs.h"
#include "esp32_can.h"

SPISettings mcpSPISettings(8000000, MSBFIRST, SPI_MODE0);

static TaskHandle_t intDelegateTask = NULL;
static const char* TAG = "CAN";
QueueHandle_t	callbackQueueM15;


/*
Issue callbacks to registered functions and objects
Used to keep this kind of thing out of the interrupt handler
The callback type and mailbox are passed in the fid member of the
CAN_FRAME struct. It isn't really used by anything.
Layout of the storage:
bit   31 -    If set indicates an object callback
bits  24-30 - Idx into listener table
bits  0-7   - Mailbox number that triggered callback
*/
void task_MCP15( void *pvParameters )
{
    MCP2515* mcpCan = (MCP2515*)pvParameters;
    CAN_FRAME rxFrame;

    while (1)
    {
        //receive next CAN frame from queue and fire off the callback
        if(xQueueReceive(callbackQueueM15, &rxFrame, portMAX_DELAY)==pdTRUE)
        {
            mcpCan->sendCallback(&rxFrame);
        }
    }
}

void task_MCPInt15( void *pvParameters )
// {
//   MCP2515* mcpCan = (MCP2515*)pvParameters;
//   while (1)
//   {
//     ulTaskNotifyTake(pdTRUE, portMAX_DELAY); //wait infinitely for this task to be notified
//     mcpCan->intHandler(); //not truly an interrupt handler anymore but still kind of
//   }
// }
{
    const TickType_t iDelay = portTICK_PERIOD_MS;
    MCP2515* mcpCan = (MCP2515*)pvParameters;
    while (1)
    {
        vTaskDelay(iDelay);
        mcpCan->intHandler(); //not truly an interrupt handler anymore
    }
}

void MCP2515::sendCallback(CAN_FRAME *frame)
{
    //frame buffer
    CANListener *thisListener;
    int mb;
    int idx;

    mb = (frame->fid & 0xFF);
    if (mb == 0xFF) mb = -1;

    if (frame->fid & 0x80000000ul) //object callback
    {
        idx = (frame->fid >> 24) & 0x7F;
        thisListener = listener[idx];
        thisListener->gotFrame(frame, mb);
    }
    else //C function callback
    {
        if (mb > -1) (*cbCANFrame[mb])(frame);
        else (*cbGeneral)(frame);
    }
}

MCP2515::MCP2515(uint8_t CS_Pin, uint8_t INT_Pin) : CAN_COMMON(6) {
  pinMode(CS_Pin, OUTPUT);
  digitalWrite(CS_Pin,HIGH);
  pinMode(INT_Pin,INPUT);
  // digitalWrite(INT_Pin,HIGH);

  // attachInterrupt(digitalPinToInterrupt(INT_Pin), MCP_INTHandler, FALLING);
  
  _CS = CS_Pin;
  _INT = INT_Pin;

  #ifdef DEBUG_SETUP  
    Serial.print("CS_Pin: ");
    Serial.print(CS_Pin);
    Serial.print("  INT_Pin: ");
    Serial.println(INT_Pin);
  #endif
  
  savedBaud = 0;
  savedFreq = 0; //Important 
  running = 0; 
  inhibitTransactions = false;
  initializedResources = false;
}

void MCP2515::initializeResources()
{
  if (initializedResources) return;

  rxQueue = xQueueCreate(MCP_RX_BUFFER_SIZE, sizeof(CAN_FRAME));
  txQueue = xQueueCreate(MCP_TX_BUFFER_SIZE, sizeof(CAN_FRAME));
  callbackQueueM15 = xQueueCreate(16, sizeof(CAN_FRAME));



                            //func        desc    stack, params, priority, handle to task, core to pin to
  BaseType_t res = xTaskCreatePinnedToCore(&task_MCP15, "CAN_RX_M15", 4096, this, 8, NULL, 0);
  if (res = pdTRUE) {
        Serial.println("task_MCP15 attached");
  }
  res = xTaskCreatePinnedToCore(&task_MCPInt15, "CAN_INT_M15", 4096, this, 100, &intDelegateTask, 0);
  if (res = pdTRUE) {
        Serial.println("task_MCPInt15 attached");
  }

  #ifdef DEBUG_SETUP  
    Serial.println("initializedResources");
  #endif

  initializedResources = true;
}

void MCP2515::setINTPin(uint8_t pin)
{
  // detachInterrupt(_INT);
  _INT = pin;
  // pinMode(_INT,INPUT);
  // digitalWrite(_INT,HIGH);
  // attachInterrupt(_INT, MCP_INTHandler, FALLING);
}

void MCP2515::setCSPin(uint8_t pin)
{
  _CS = pin;
  pinMode(_CS, OUTPUT);
  digitalWrite(_CS,HIGH);
}

/*
  Initialize MCP2515
  
  int CAN_Bus_Speed = transfer speed in kbps (or raw CAN speed in bits per second)
  int Freq = MCP2515 oscillator frequency in MHz
  int SJW = Synchronization Jump Width Length bits - 1 to 4 (see data sheet)
  
  returns baud rate set
  
  Sending a bus speed of 0 kbps initiates AutoBaud and returns zero if no
  baud rate could be determined.  There must be two other active nodes on the bus!
*/
int MCP2515::Init(uint32_t CAN_Bus_Speed, uint8_t Freq) {
  if(CAN_Bus_Speed>0) {
    if(_init(CAN_Bus_Speed, Freq, 1, false)) {
		savedBaud = CAN_Bus_Speed;
		savedFreq = Freq;
		running = 1;
	    return CAN_Bus_Speed;
    }
  } else {
	int i=0;
	uint8_t interruptFlags = 0;
	for(i=5; i<1000; i=i+5) {
	  if(_init(i, Freq, 1, true)) {
		// check for bus activity
		Write(CANINTF,0);
		delay(500); // need the bus to be communicating within this time frame
		if(Interrupt()) {
		  // determine which interrupt flags have been set
		  interruptFlags = Read(CANINTF);
		  if(!(interruptFlags & MERRF)) {
		    // to get here we must have received something without errors
		    Mode(MODE_NORMAL);
			savedBaud = i;
			savedFreq = Freq;	
			running = 1;
			return i;
		  }
		}
	  }
	}
  }
  return 0;
}

int MCP2515::Init(uint32_t CAN_Bus_Speed, uint8_t Freq, uint8_t SJW) {
  if(SJW < 1) SJW = 1;
  if(SJW > 4) SJW = 4;
  if(CAN_Bus_Speed>0) {
    if(_init(CAN_Bus_Speed, Freq, SJW, false)) {
		savedBaud = CAN_Bus_Speed;
		savedFreq = Freq;
		running = 1;
	    return CAN_Bus_Speed;
    }
  } else {
	int i=0;
	uint8_t interruptFlags = 0;
	for(i=5; i<1000; i=i+5) {
	  if(_init(i, Freq, SJW, true)) {
		// check for bus activity
		Write(CANINTF,0);
		delay(500); // need the bus to be communicating within this time frame
		if(Interrupt()) {
		  // determine which interrupt flags have been set
		  interruptFlags = Read(CANINTF);
		  if(!(interruptFlags & MERRF)) {
		    // to get here we must have received something without errors
		    Mode(MODE_NORMAL);
			savedBaud = i;
			savedFreq = Freq;
			running = 1;
			return i;
		  }
		}
	  }
	}
  }
  return 0;
}

bool MCP2515::_init(uint32_t CAN_Bus_Speed, uint8_t Freq, uint8_t SJW, bool autoBaud) {

  SPI.begin(MCP2515_SCK, MCP2515_MISO, MCP2515_MOSI);       //Set up Serial Peripheral Interface Port for CAN2
  SPI.setClockDivider(SPI_CLOCK_DIV32);
  SPI.setDataMode(SPI_MODE0);
  SPI.setBitOrder(MSBFIRST);
  SPI.setHwCs(false); //allow manual control of CS line

  #ifdef DEBUG_SETUP  
    Serial.print("MCP2515_SCK: ");
    Serial.print(MCP2515_SCK);
    Serial.print("  MCP2515_MISO: ");
    Serial.println(MCP2515_MISO);
    Serial.print("  MCP2515_MOSI: ");
    Serial.println(MCP2515_MOSI);
  #endif

