amperserwis/collin80_esp32_can/src/mcp2515.cpp
  Write(CANINTE,0); //disable all interrupts during init

  if (!initializedResources) initializeResources();
  
  // Reset MCP2515 which puts it in configuration mode
  Reset();
  //delay(2);

  Write(CANINTE,0); //disable all interrupts during init
  Write(TXB0CTRL, 0); //reset transmit control
  Write(TXB1CTRL, 0); //reset transmit control
  Write(TXB2CTRL, 0); //reset transmit control
  
  // Calculate bit timing registers
  uint8_t BRP;
  float TQ;
  uint8_t BT;
  float tempBT;
  float freqMhz = Freq * 1000000.0;
  float bestMatchf = 10.0;
  int bestMatchIdx = 10;
  float savedBT;

  #ifdef DEBUG_SETUP  
    Serial.print("CAN_Bus_Speed: ");
    Serial.print(CAN_Bus_Speed);
    Serial.print("  freqMhz: ");
    Serial.println(freqMhz);
  #endif

  float speed = CAN_Bus_Speed;
  if (speed > 5000.0) speed *= 0.001;

  float NBT = 1.0 / (speed * 1000.0); // Nominal Bit Time - How long a single CAN bit should take

  //Now try each divisor to see which can most closely match the target.
  for(BRP=0; BRP < 63; BRP++) {
    TQ = 2.0 * (float)(BRP + 1) / (float)freqMhz;
    tempBT = NBT / TQ;

    BT = (int)tempBT;
    if ( (tempBT - BT) < bestMatchf)
    {
        if (BT > 7 && BT < 25)
        {
            bestMatchf = (tempBT - BT);
            bestMatchIdx = BRP;
            savedBT = BT;
        }
    }
  }

  BT = savedBT;
  BRP = bestMatchIdx;
 
  byte SPT = (0.7 * BT); // Sample point
  byte PRSEG = (SPT - 1) / 2;
  byte PHSEG1 = SPT - PRSEG - 1;
  byte PHSEG2 = BT - PHSEG1 - PRSEG - 1;

  // Programming requirements
  if(PRSEG + PHSEG1 < PHSEG2) 
  {
      //Serial.println("PRSEG + PHSEG1 less than PHSEG2!");
      return false;
  }
  if(PHSEG2 <= SJW) 
  {
      //Serial.println("PHSEG2 less than SJW");
      return false;
  }
  
  uint8_t BTLMODE = 1;
  uint8_t SAMPLE = 0;
  
  // Set registers
  byte data = (((SJW-1) << 6) | BRP);
  Write(CNF1, data);
  Write(CNF2, ((BTLMODE << 7) | (SAMPLE << 6) | ((PHSEG1-1) << 3) | (PRSEG-1)));
  Write(CNF3, (B10000000 | (PHSEG2-1)));
  Write(TXRTSCTRL,0);

  Write(CNF1, data);
  delay(1);

  InitFilters(false);
  
  if(!autoBaud) {
    // Return to Normal mode
    if(!Mode(MODE_NORMAL)) 
    {
        //Serial.println("Could not enter normal mode");
        return false;
    }
  } else {
    // Set to Listen Only mode
    if(!Mode(MODE_LISTEN)) 
    {
        //Serial.println("Could not enter listen only mode");
        return false;
    }
  }
  // Enable all interupts
  Write(CANINTE,255);
  
  // Test that we can read back from the MCP2515 what we wrote to it
  byte rtn = Read(CNF1);
  if (rtn == data) return true;
  else 
  {
    Serial.println(data, HEX);
    Serial.println(rtn, HEX);
    return false;
  }

  return false;
}

uint16_t MCP2515::available()
{
  if (!rxQueue) return 0; //why would this happen though?!
  return uxQueueMessagesWaiting(rxQueue);
}

int MCP2515::_setFilter(uint32_t id, uint32_t mask, bool extended)
{
    uint32_t filterVal;
    boolean isExtended;

    for (int i = 0; i < 6; i++)
    {
        if (i < 3)
            GetRXFilter(FILTER0 + (i * 4), filterVal, isExtended);
        else
            GetRXFilter(FILTER3 + ((i-3) * 4), filterVal, isExtended);

        if (filterVal == 0 && isExtended == extended) //empty filter. Let's fill it and leave
        {
            if (i < 2)
            {
                GetRXMask(MASK0, filterVal);
                if (filterVal == 0) filterVal = mask;
                filterVal &= mask;
                SetRXMask(MASK0, filterVal);
            }
            else
            {
                GetRXMask(MASK1, filterVal);
                if (filterVal == 0) filterVal = mask;
                filterVal &= mask;
                SetRXMask(MASK1, filterVal);
            }
            if (i < 3)
                SetRXFilter(FILTER0 + (i * 4), id, extended);
            else
                SetRXFilter(FILTER3 + ((i-3) * 4), id, extended);
            return i;
        }
    }

    //if we got here then there were no free filters. Return value of deaaaaath!
    return -1;
}

//we don't exactly have mailboxes, we have filters (6 of them) but it's the same basic idea
int MCP2515::_setFilterSpecific(uint8_t mailbox, uint32_t id, uint32_t mask, bool extended)
{
    uint32_t oldMask;
    if (mailbox < 2) //MASK0
    {
        GetRXMask(MASK0, oldMask);
        oldMask &= mask;
        SetRXMask(MASK0, oldMask);
        
    }
    else //MASK1
    {
        GetRXMask(MASK1, oldMask);
        oldMask &= mask;
        SetRXMask(MASK0, oldMask);
        
    }
    if (mailbox < 3)
        SetRXFilter(FILTER0 + (mailbox * 4), id, extended);
    else
        SetRXFilter(FILTER3 + ((mailbox-3) * 4), id, extended);

    return mailbox;
}

uint32_t MCP2515::init(uint32_t ul_baudrate)
{
    return Init(ul_baudrate, 8);
}

uint32_t MCP2515::beginAutoSpeed()
{
    return Init(0, 8);
}

uint32_t MCP2515::set_baudrate(uint32_t ul_baudrate)
{
    return Init(ul_baudrate, 8);
}

void MCP2515::setListenOnlyMode(bool state)
{
    if (state)
        Mode(MODE_LISTEN);
    else Mode(MODE_NORMAL);
}

void MCP2515::setBuffer0RolloverBUKT(bool enable) {
    const byte oldMode = Read(CANSTAT);

    if (oldMode != MODE_CONFIG) {
        if (!Mode(MODE_CONFIG)) {
            Serial.println("Unable to change to config mode to set BUKT");
            return;
        }
    }

    byte oldValue = Read(RXB0CTRL);

    if (enable) {
        Write(RXB0CTRL, oldValue | RXB0BUKT);
    } else {
        Write(RXB0CTRL, oldValue & ~RXB0BUKT);
    }

    if (oldMode != MODE_CONFIG) {
        Mode(oldMode);
    }
}

void MCP2515::enable()
{
    Mode(MODE_NORMAL);
}

void MCP2515::disable()
{
    Mode(MODE_CONFIG); //should knock it off the CAN bus and keep it from doing anything
}

bool MCP2515::sendFrame(CAN_FRAME& txFrame)
{
    EnqueueTX(txFrame);
    return true;
}

bool MCP2515::rx_avail()
{
    return available()>0?true:false;
}

uint32_t MCP2515::get_rx_buff(CAN_FRAME &msg)
{
    return GetRXFrame(msg);
}

void MCP2515::Reset() {
  if (!inhibitTransactions) SPI.beginTransaction(mcpSPISettings);
  digitalWrite(_CS,LOW);
  SPI.transfer(CAN_RESET);
  digitalWrite(_CS,HIGH);
  if (!inhibitTransactions) SPI.endTransaction();
}

uint8_t MCP2515::Read(uint8_t address) {
  if (!inhibitTransactions) SPI.beginTransaction(mcpSPISettings);
  digitalWrite(_CS,LOW);
  SPI.transfer(CAN_READ);
  SPI.transfer(address);
  uint8_t data = SPI.transfer(0x00);
  digitalWrite(_CS,HIGH);
  if (!inhibitTransactions) SPI.endTransaction();
  return data;
}

void MCP2515::Read(uint8_t address, uint8_t data[], uint8_t bytes) {
  // allows for sequential reading of registers starting at address - see data sheet
  uint8_t i;
  if (!inhibitTransactions) SPI.beginTransaction(mcpSPISettings);
  digitalWrite(_CS,LOW);
  SPI.transfer(CAN_READ);
  SPI.transfer(address);
  for(i=0;i<bytes;i++) {
    data[i] = SPI.transfer(0x00);
  }
  digitalWrite(_CS,HIGH);
  if (!inhibitTransactions) SPI.endTransaction();
}

CAN_FRAME MCP2515::ReadBuffer(uint8_t buffer) {
 
  // Reads an entire RX buffer.
  // buffer should be either RXB0 or RXB1
  
  CAN_FRAME message;
  
