amperserwis/collin80_esp32_can/src/mcp2515.cpp
/*
mask = either MASK0 or MASK1
MaskValue is either an 11 or 29 bit mask value to set 
Note that maskes do not store whether they'd be standard or extended. Filters do that. It's a little confusing
*/
void MCP2515::SetRXMask(uint8_t mask, uint32_t MaskValue) {
	uint8_t temp_buff[4];
	uint8_t oldMode;
	
	oldMode = Read(CANSTAT);
	Mode(MODE_CONFIG); //have to be in config mode to change mask

	temp_buff[0] = byte(MaskValue >> 3);
	temp_buff[1] = byte((MaskValue & 7)  << 5);
  temp_buff[1] |= byte(MaskValue >> 27);
	temp_buff[2] = byte(MaskValue >> 19);
	temp_buff[3] = byte(MaskValue >> 11);
	
	Write(mask, temp_buff, 4); //send the four byte mask out to the proper address
	
	Mode(oldMode);
}

/*
filter = FILTER0, FILTER1, FILTER2, FILTER3, FILTER4, FILTER5 (pick one)
FilterValue = 11 or 29 bit filter to use
ext is true if this filter should apply to extended frames or false if it should apply to standard frames.
Do note that, while this function looks a lot like the mask setting function is is NOT identical
It might be able to be though... The setting of EXIDE would probably just be ignored by the mask
*/
void MCP2515::SetRXFilter(uint8_t filter, uint32_t FilterValue, bool ext) {
	uint8_t temp_buff[4];
	uint8_t oldMode;
		
	oldMode = Read(CANSTAT);

	Mode(MODE_CONFIG); //have to be in config mode to change mask
	temp_buff[0] = byte(FilterValue >> 3);
	temp_buff[1] = byte((FilterValue & 7)  << 5);
	temp_buff[2] = 0;
	temp_buff[3] = 0;

	if (ext) { //fill out all 29 bits
    temp_buff[1] |= 1 << 3; //set EXIDE
    temp_buff[1] |= byte(FilterValue >> 27);
		temp_buff[2] = byte(FilterValue >> 19);
		temp_buff[3] = byte(FilterValue >> 11);
	}
	
	Write(filter, temp_buff, 4); //send the four byte mask out to the proper address
	
	Mode(oldMode);
}

void MCP2515::GetRXFilter(uint8_t filter, uint32_t &filterVal, boolean &isExtended)
{
    uint8_t temp_buff[4];
	uint8_t oldMode;
		
	oldMode = Read(CANSTAT);

	Mode(MODE_CONFIG); //have to be in config mode to change mask

    Read(filter, temp_buff, 4);

    //these 11 bits are used either way and stored the same way either way
    filterVal = temp_buff[0] << 3;
    filterVal |= temp_buff[1] >> 5;
    isExtended = false;

    if (temp_buff[1] & B00001000) //extended / 29 bit filter - get the remaining 18 bits we need
    {
        isExtended = true;
        filterVal |= (temp_buff[1] & 3) << 27;
        filterVal |= temp_buff[2] << 19;
        filterVal |= temp_buff[3] << 11;
    }

	Mode(oldMode);
}

void MCP2515::GetRXMask(uint8_t mask, uint32_t &filterVal)
{
  uint8_t temp_buff[4];
	uint8_t oldMode;

	oldMode = Read(CANSTAT);

	Mode(MODE_CONFIG); //have to be in config mode to change mask

  Read(mask, temp_buff, 4);

  filterVal = temp_buff[0] << 3;
  filterVal |= temp_buff[1] >> 5;
  filterVal |= (temp_buff[1] & 3) << 27;
  filterVal |= temp_buff[2] << 19;
  filterVal |= temp_buff[3] << 11;

	Mode(oldMode);
}


//Places the given frame into the receive queue
void MCP2515::EnqueueRX(CAN_FRAME& newFrame) {
  xQueueSendFromISR(rxQueue, &newFrame, NULL);
}

//Places the given frame into the transmit queue
//Well, maybe. If there is currently an open hardware buffer
//it will place it into hardware immediately instead of using
//the software queue
void MCP2515::EnqueueTX(CAN_FRAME& newFrame) {
  //BaseType_t xHigherPriorityTaskWoken = pdFALSE;
  xQueueSend(txQueue, &newFrame, 0);
  //xHigherPriorityTaskWoken = xTaskNotifyGive(intDelegateTask); //send notice to the handler task that it can do the SPI transaction now
  //if (xHigherPriorityTaskWoken == pdTRUE) 
}

bool MCP2515::GetRXFrame(CAN_FRAME &frame) {
  ESP_LOGD(TAG, "read");
  if (xQueueReceive(rxQueue, &frame, 0) == pdTRUE) return true;
	return false;
}

void MCP2515::intHandler(void) {
    //Serial.print("i");
    CAN_FRAME message;
    uint32_t ctrlVal;
    inhibitTransactions = true;
    SPI.beginTransaction(mcpSPISettings);
    // determine which interrupt flags have been set
    uint8_t interruptFlags = Read(CANINTF);
    uint8_t status = Status();
    //Serial.println(status);
      /*
  bit 7 - CANINTF.TX2IF             128
  bit 6 - TXB2CNTRL.TXREQ           64
  bit 5 - CANINTF.TX1IF             32
  bit 4 - TXB1CNTRL.TXREQ           16
  bit 3 - CANINTF.TX0IF             8
  bit 2 - TXB0CNTRL.TXREQ           4
  bit 1 - CANINTF.RX1IF            2
  bit 0 - CANINTF.RX0IF             1
  */
    
    if((status & 1)) //RX buff 0 full
    {
      // read from RX buffer 0
      message = ReadBuffer(RXB0);
      ctrlVal = Read(RXB0CTRL);
      handleFrameDispatch(&message, ctrlVal & 1);
    }
    if((status & 2)) //RX buff 1 full
    {
      // read from RX buffer 1
      message = ReadBuffer(RXB1);
      ctrlVal = Read(RXB1CTRL);
      handleFrameDispatch(&message, ctrlVal & 7);
    }
    if((status & 4) == 0) //TX buffer 0 is not pending a transaction
    {
      if (uxQueueMessagesWaitingFromISR(txQueue)) {
        xQueueReceiveFromISR(txQueue, &message, 0);
			  LoadBuffer(TXB0, &message);
		   	SendBuffer(TXB0);
	    }
    }
    if((status & 16) == 0) //TX buffer 1 not pending any message to send 
    {
      if (uxQueueMessagesWaitingFromISR(txQueue)) {
        xQueueReceiveFromISR(txQueue, &message, 0);
			  LoadBuffer(TXB1, &message);
		   	SendBuffer(TXB1);
	    }
    }
    if((status & 64) == 0) //TX buffer 2 not pending any message to send 
    {
      if (uxQueueMessagesWaitingFromISR(txQueue)) {
        xQueueReceiveFromISR(txQueue, &message, 0);
			  LoadBuffer(TXB2, &message);
		   	SendBuffer(TXB2);
	    }
    }
    if(interruptFlags & ERRIF) {
      //Serial.println("E");
    }
    if(interruptFlags & MERRF) {
      //Serial.println("M");
    }

    Write(CANINTF, 0); //Now, acknowledge the interrupts by clearing the intf bits
    Write(EFLG, 0); //clear RX overflow flags

    inhibitTransactions = false;
    SPI.endTransaction();
}

void MCP2515::handleFrameDispatch(CAN_FRAME *frame, int filterHit)
{
  CANListener *thisListener;
  ESP_LOGD(TAG, "recieved");
  //First, try to send a callback. If no callback registered then buffer the frame.
  if (cbCANFrame[filterHit]) 
	{
    frame->fid = filterHit;
    xQueueSendFromISR(callbackQueueM15, frame, 0);
    return;
	}
	else if (cbGeneral) 
	{
    frame->fid = 0xFF;
    xQueueSendFromISR(callbackQueueM15, frame, 0);
    return;
	}
	else
	{
		for (int listenerPos = 0; listenerPos < SIZE_LISTENERS; listenerPos++)
		{
			thisListener = listener[listenerPos];
			if (thisListener != NULL)
			{
				if (thisListener->isCallbackActive(filterHit)) 
				{
					frame->fid = 0x80000000ul + (listenerPos << 24ul) + filterHit;
          xQueueSendFromISR(callbackQueueM15, frame, 0);
          return;
				}
				else if (thisListener->isCallbackActive(numFilters)) //global catch-all 
				{
					frame->fid = 0x80000000ul + (listenerPos << 24ul) + 0xFF;
          xQueueSendFromISR(callbackQueueM15, frame, 0);
          return;
				}
			}
		}
	} 
	//if none of the callback types caught this frame then queue it in the buffer
  xQueueSendFromISR(rxQueue, frame, NULL);
}
